; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p7---int100n150-m25---int100c110---s51---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level13 level13)
(sum level0 level20 level20)
(sum level1 level1 level2)
(sum level1 level13 level14)
(sum level1 level20 level21)
(sum level2 level1 level3)
(sum level2 level13 level15)
(sum level2 level20 level22)
(sum level3 level1 level4)
(sum level3 level13 level16)
(sum level3 level20 level23)
(sum level4 level1 level5)
(sum level4 level13 level17)
(sum level4 level20 level24)
(sum level5 level1 level6)
(sum level5 level13 level18)
(sum level5 level20 level25)
(sum level6 level1 level7)
(sum level6 level13 level19)
(sum level6 level20 level26)
(sum level7 level1 level8)
(sum level7 level13 level20)
(sum level7 level20 level27)
(sum level8 level1 level9)
(sum level8 level13 level21)
(sum level8 level20 level28)
(sum level9 level1 level10)
(sum level9 level13 level22)
(sum level9 level20 level29)
(sum level10 level1 level11)
(sum level10 level13 level23)
(sum level11 level1 level12)
(sum level11 level13 level24)
(sum level12 level1 level13)
(sum level12 level13 level25)
(sum level13 level1 level14)
(sum level13 level13 level26)
(sum level14 level1 level15)
(sum level14 level13 level27)
(sum level15 level1 level16)
(sum level15 level13 level28)
(sum level16 level1 level17)
(sum level16 level13 level29)
(sum level17 level1 level18)
(sum level18 level1 level19)
(sum level19 level1 level20)
(sum level20 level1 level21)
(sum level21 level1 level22)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)
(sum level25 level1 level26)
(sum level26 level1 level27)
(sum level27 level1 level28)
(sum level28 level1 level29)

(connected l0 l1)
(fuelcost level13 l0 l1)
(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l1 l0)
(fuelcost level13 l1 l0)
(connected l1 l2)
(fuelcost level20 l1 l2)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level20 l2 l1)

(at t0 l0)
(fuel t0 level29)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l0)
(at p6 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l1)
(at p3 l1)
(at p4 l0)
(at p5 l2)
(at p6 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 7
2. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 7
3. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 7
4. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 7
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 7
6. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 7
7. (drive t0 l0 l1 level16 level13 level29)
   deleted: (at t0 l0) (fuel t0 level29)
   added: (at t0 l1) (fuel t0 level16)
   goals met: 0 of 7
8. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 7
9. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 7
10. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 7
11. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 3 of 7
12. (drive t0 l1 l0 level3 level13 level16)
   deleted: (at t0 l1) (fuel t0 level16)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 3 of 7
13. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 4 of 7
14. (drive t0 l0 l2 level2 level1 level3)
   deleted: (at t0 l0) (fuel t0 level3)
   added: (at t0 l2) (fuel t0 level2)
   goals met: 4 of 7
15. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 5 of 7
16. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 6 of 7
17. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 7 of 7
